Tekla Open API Reference for Tekla Structures 2025
Operation.CreateConicalBentPlateByPartsAndTwoRadiuses Method
 Modifies the first plate by adding a conical bend that connects it to the second plate creating a new BentPlate instance based on two parts. The resulting bend will have the two given radiuses.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BentPlate CreateConicalBentPlateByPartsAndTwoRadiuses(
	Part part1,
	Part part2,
	double firstRadius,
	double secondRadius
)
Public Shared Function CreateConicalBentPlateByPartsAndTwoRadiuses (
	part1 As Part,
	part2 As Part,
	firstRadius As Double,
	secondRadius As Double
) As BentPlate
Parameters
part1
Type: Tekla.Structures.Model.Part
One part used for creating the bent plate.
part2
Type: Tekla.Structures.Model.Part
The other part used for creating the bent plate.
firstRadius
Type: System.Double
Radius of one section of the cone
secondRadius
Type: System.Double
Radius of the other section of the cone
Return Value
Type: BentPlate
The bent plate object if successful, null otherwise
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace